Documents/ИА_Статистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_Статистика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИА_УчетСтатистик</xr:Item>
				<xr:Item>AccumulationRegister.ИА_УчетВопросовСтатистик</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПредставление1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПредставление2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПредставление3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаВМобильномПриложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыПроверочногоСписка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВопросыПроверочногоСписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Балл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВопросТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПакетСтатистик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ИА_ВопросыПроверочногоСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВопросыПроверочногоСписка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_ПроверочныйСписок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантныйОтвет</Name>
					<Comment>Простой/Вариантный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Балл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ИА_Статистика/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
&НаКлиенте
Перем ПредАн1,ПредАн2;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВводНесколькихЗначений Тогда
		ОбновитьДеревоПакета();
	КонецЕсли;
	
	НастроитьДоступностьАналитик();
	ОбновитьДоступностьПакетногоВвода();
	УстановитьКоличествоАналитик();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Количество = 0;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.ДатаВведения = ТекущаяДата();
	КонецЕсли;
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	//
	Если Параметры.Свойство("БыстрыйРежим") Тогда 
		БыстрыйРежим = Параметры.БыстрыйРежим;
	КонецЕсли;
	Если Параметры.Свойство("ВидСтатистики") Тогда 
		Объект.ВидСтатистики = Параметры.ВидСтатистики;
		СтатистикиВидСтатистикиПриИзменении_Сервер();
	КонецЕсли;
	
	Если Параметры.Свойство("Аналитика1") Тогда 
		Объект.Аналитика1 = Параметры.Аналитика1;
	КонецЕсли;
	Если Параметры.Свойство("Аналитика2") Тогда 
		Объект.Аналитика2 = Параметры.Аналитика2;
	КонецЕсли;
	Если Параметры.Свойство("Аналитика3") Тогда 
		Объект.Аналитика3 = Параметры.Аналитика3;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьПакетногоВвода()
	ЭтоПакет = Объект.ВводНесколькихЗначений;
	
	Элементы.ГруппаПакет.Видимость = ЭтоПакет;
	Элементы.ВидСтатистики.Доступность = не ЭтоПакет;
	
	Элементы.Аналитика1.Видимость = не ЭтоПакет и КоличествоАналитик>=1;
	Элементы.Аналитика2.Видимость = не ЭтоПакет и КоличествоАналитик>=2;
	Элементы.Аналитика3.Видимость = не ЭтоПакет и КоличествоАналитик=3;
	
	Элементы.Количество.Видимость = не ЭтоПакет;
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьАналитик()
	
	ОбновитьВидимостьАналитикПакета();
	
	Если не Объект.ВидСтатистики.Пустая() Тогда
		Если не Объект.ВидСтатистики.Аналитика1.Пустая() Тогда
			Элементы.Аналитика1.Заголовок = Объект.ВидСтатистики.Аналитика1.Наименование;
			Элементы.Аналитика1.Видимость = Истина;
			Элементы.Аналитика1.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Аналитика1);
			
			Элементы.ПакетноеДеревоАналитика1.Заголовок = Объект.ВидСтатистики.Аналитика1.Наименование;
		Конецесли;                                                                           
		
		Если не ЗначениеЗаполнено(Объект.Аналитика1) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика1.ТипАналитикиПолный,Элементы.Аналитика1, Объект.Аналитика1);
		КонецЕсли;
		
		Если не Объект.ВидСтатистики.Аналитика2.Пустая() Тогда
			Элементы.Аналитика2.Заголовок = Объект.ВидСтатистики.Аналитика2.Наименование;
			Элементы.Аналитика2.Видимость = Истина;
			Элементы.Аналитика2.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Аналитика2);
			
			Элементы.ПакетноеДеревоАналитика2.Заголовок = Объект.ВидСтатистики.Аналитика2.Наименование;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика2) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика2.ТипАналитикиПолный,Элементы.Аналитика2, Объект.Аналитика2);
		КонецЕсли;
		
		Если не Объект.ВидСтатистики.Аналитика3.Пустая() Тогда
			Элементы.Аналитика3.Заголовок = Объект.ВидСтатистики.Аналитика3.Наименование;
			Элементы.Аналитика3.Видимость = Истина;
			Элементы.Аналитика3.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Аналитика3);
			
			Элементы.ПакетноеДеревоАналитика3.Заголовок = Объект.ВидСтатистики.Аналитика3.Наименование;
		Конецесли;
		
		Если не ЗначениеЗаполнено(Объект.Аналитика3) Тогда
			УстановитьТип(Объект.ВидСтатистики.Аналитика3.ТипАналитикиПолный,Элементы.Аналитика3, Объект.Аналитика3);
		КонецЕсли;
	Иначе
		Элементы.Аналитика1.Видимость = ложь;
		Элементы.Аналитика2.Видимость = ложь;
		Элементы.Аналитика3.Видимость = ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьПакетногоВвода()
	Разрешено = истина;
	Если ЗначениеЗаполнено(Объект.ВидСтатистики.ПроверочныйСписок) ИЛИ не ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика1) Тогда
		Разрешено = ложь;
	КонецЕсли;
	
	Элементы.ВводНесколькихЗначений.Доступность = Разрешено;
КонецПроцедуры

&НаСервере
Процедура УстановитьТип(ЗначТип,ЭлФормы,Рекв)
	Если ЗначТип = "" Тогда
		Возврат
	КонецЕсли;

    Массив = Новый Массив;
	Массив.Добавить(Тип(ЗначТип));       
	Стр = Новый ОписаниеТипов(Массив);
	ЭлФормы.ОграничениеТипа = Стр;                 
	ЭлФормы.ОграничениеТипа.ПривестиЗначение();
	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисления");
	Если ЗначТип1 = "" Тогда 		
		Рекв = Справочники.ИА_ЗначениеАналитики.ПустаяСсылка();
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		Рекв = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		Рекв = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		Рекв = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		Рекв = Дата("01010001");
	Иначе
		Рекв = Вычислить(ЗначТип1+".ПустаяСсылка()");
	КонецЕсли;
	
	ЭлФормы.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьАналитикПакета()	
	Элементы.ПакетноеДеревоАналитика1.Видимость = ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика1);
	Элементы.ПакетноеДеревоАналитика2.Видимость = ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика2);
	Элементы.ПакетноеДеревоАналитика3.Видимость = ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика3);
КонецПроцедуры

&НаКлиенте
Процедура ВидСтатистикиПриИзменении(Элемент)
	
	ПакетноеДерево.ПолучитьЭлементы().Очистить();
	
	Элементы.Аналитика1.Заголовок = "Аналитика1:";
	Элементы.Аналитика2.Заголовок = "Аналитика2:";
	Элементы.Аналитика3.Заголовок = "Аналитика3:";
	Объект.Аналитика1 = Неопределено;
	Объект.Аналитика2 = Неопределено;
	Объект.Аналитика3 = Неопределено;
	Элементы.Аналитика1.Видимость = Ложь;
	Элементы.Аналитика2.Видимость = Ложь;
	Элементы.Аналитика3.Видимость = Ложь;
	
	Объект.Количество = 0;
	
	СтатистикиВидСтатистикиПриИзменении_Сервер();
	ВопросыПроверочногоСпискаУстановитьВидимость();	
КонецПроцедуры

&НаСервере
Процедура СтатистикиВидСтатистикиПриИзменении_Сервер() Экспорт
	
	НастроитьДоступностьАналитик();
	ОбновитьДоступностьПакетногоВвода();
	УстановитьКоличествоАналитик();
	
	ВопросыПроверочногоСпискаЗаполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(1, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(2, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(3, Элемент, Неопределено, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитики(номерАналитики, Элемент, тд = Неопределено, СтандартнаяОбработка)
	пт = ПолучитьПолныйТип(ОБъект.ВидСтатистики, номерАналитики);
	Если пт = "СправочникСсылка.ИА_ЗначениеАналитики" или пт = "" Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура("Владелец", ПолучитьЗначениеАналитики(Объект.ВидСтатистики,номерАналитики));
		зн = Неопределено;

		ОткрытьФорму("Справочник.ИА_ЗначениеАналитики.Форма.ФормаВыбораУпр", СтруктураОтбора,,,,, Новый ОписаниеОповещения("НачалоВыбораАналитикиЗавершение", ЭтотОбъект, Новый Структура("номерАналитики, тд", номерАналитики, тд)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитикиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	номерАналитики = ДополнительныеПараметры.номерАналитики;
	тд = ДополнительныеПараметры.тд;
	
	
	//ПараметрыВыбора = Новый Структура("Отбор", СтруктураОтбора);
	
	зн = Результат;
	
	Если ЗначениеЗаполнено(зн) Тогда
		Если тд = Неопределено ТОгда
			Объект["Аналитика"+номерАналитики] = зн;
		Иначе
			тд["Аналитика"+номерАналитики] = зн;
			УстановитьАналитикуВСтрокиДерева(тд, номерАналитики);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПолныйТип(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики].ТипАналитикиПолный;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАналитики(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики];
КонецФункции

&НаКлиенте
Процедура ВопросыПроверочногоСпискаУстановитьВидимость()
	
	ЭтоПС = ЭтоПроверочныйСписок(Объект.ВидСтатистики);

	Элементы.ВопросыПроверочногоСписка.Видимость = ЭтоПС;
	Элементы.Количество.ТолькоПросмотр = ЭтоПС;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПроверочныйСписок(ВидСтат)
	возврат  не ВидСтат.ПроверочныйСписок.Пустая();
КонецФункции

&НаСервере
Процедура ВопросыПроверочногоСпискаЗаполнить()
	
	Если Не ЗначениеЗаполнено(Объект.ВидСтатистики) Тогда
		Объект.ВопросыПроверочногоСписка.Очистить();
		Возврат;
	КонецЕсли; 
	
	ПроверочныйСписок = Объект.ВидСтатистики.ПроверочныйСписок;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ВопросыПроверочногоСписка.Ссылка КАК Вопрос,
	               |	ИА_ВопросыПроверочногоСписка.ВариантныйОтвет КАК ВариантныйОтвет,
	               |	ИА_ВопросыПроверочногоСписка.ОтветВопроса КАК ОтветВопроса,
	               |	ВЫБОР
	               |		КОГДА НЕ ИА_ВопросыПроверочногоСписка.ВариантныйОтвет
	               |				И ИА_ВопросыПроверочногоСписка.ОтветВопроса = 1
	               |			ТОГДА 0
	               |		КОГДА НЕ ИА_ВопросыПроверочногоСписка.ВариантныйОтвет
	               |				И ИА_ВопросыПроверочногоСписка.ОтветВопроса = 2
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК Ответ,
	               |	ИА_ВопросыПроверочногоСписка.Вопрос КАК ВопросТекст
	               |ИЗ
	               |	Справочник.ИА_ВопросыПроверочногоСписка КАК ИА_ВопросыПроверочногоСписка
	               |ГДЕ
	               |	ИА_ВопросыПроверочногоСписка.Владелец = &ПроверочныйСписок
	               |	И НЕ ИА_ВопросыПроверочногоСписка.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("ПроверочныйСписок", ПроверочныйСписок);
	Объект.ВопросыПроверочногоСписка.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаВопросНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаВопросОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаОтветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	ТекущаяСтрока = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
	Если ТекущаяСтрока.ВариантныйОтвет Тогда
		СтандартнаяОбработка = Ложь;
		ВыбранноеЗначение = Неопределено;
	
		ВыбранноеЗначение = ВыбратьИзСписка(ПолучитьСписокОтветов(ТекущаяСтрока.Вопрос));
		ТекущаяСтрока.Ответ = ?(ВыбранноеЗначение = Неопределено, Неопределено, ВыбранноеЗначение.Значение);
			
		ПересчитатьБаллСтроки(ТекущаяСтрока);
		
		Модифицированность = Истина;

	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьБаллСтроки(ТекСтрока)
	
	Если ТекСтрока.Ответ <> Неопределено Тогда
		ТекСтрока.Балл = РассчитатьБаллВСтроке(ТекСтрока.Вопрос, ТекСтрока.ВариантныйОтвет, ТекСтрока.Ответ);		
	Иначе
		ТекСтрока.Балл = 0;
	КонецЕсли; 
	
	итого = 0;
	Для каждого стр из Объект.ВопросыПроверочногоСписка Цикл
		итого = итого + стр.Балл;
	КонецЦикла;
	Объект.Количество = итого;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОтветов(Вопрос)
	
	СписокОтветов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ответ
	               |ИЗ
	               |	Справочник.ИА_ВопросыПроверочногоСписка.ВариантыОтветов КАК ИА_ВопросыПроверочногоСпискаВариантыОтветов
	               |ГДЕ
	               |	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ссылка = &Вопрос";
				   
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОтветов.Добавить(Выборка.Ответ);
	КонецЦикла; 
	
	Возврат СписокОтветов;
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьБаллВСтроке(Вопрос, ВариантныйОтвет, Ответ)
	
	БаллВСтроке = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	Запрос.УстановитьПараметр("Ответ", Ответ);
	Запрос.УстановитьПараметр("ВариантныйОтвет", ВариантныйОтвет);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Балл
	               |ИЗ
	               |	Справочник.ИА_ВопросыПроверочногоСписка.ВариантыОтветов КАК ИА_ВопросыПроверочногоСпискаВариантыОтветов
	               |ГДЕ
	               |	ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ссылка = &Вопрос
	               |	И ИА_ВопросыПроверочногоСпискаВариантыОтветов.Ответ = &Ответ
	               |	И &ВариантныйОтвет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИА_ВопросыПроверочногоСписка.БаллВопроса
	               |ИЗ
	               |	Справочник.ИА_ВопросыПроверочногоСписка КАК ИА_ВопросыПроверочногоСписка
	               |ГДЕ
	               |	ИА_ВопросыПроверочногоСписка.Ссылка = &Вопрос
	               |	И НЕ &ВариантныйОтвет";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БаллВСтроке = Выборка.Балл;		
	КонецЕсли;
	Если Не ВариантныйОтвет И (ТипЗНЧ(Ответ) = Тип("Булево") ИЛИ ТипЗНЧ(Ответ) = Тип("Число")) Тогда
		БаллВСтроке = БаллВСтроке * Ответ;		
	КонецЕсли; 
	
	Возврат БаллВСтроке;
	
КонецФункции

&НаКлиенте
Процедура ВопросыПроверочногоСпискаОтветОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
	ТекущаяСтрока.Балл = 0;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВопросыПроверочногоСпискаЗаполнитьСлужебныеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ВопросыПроверочногоСпискаЗаполнитьСлужебныеРеквизиты()
	
	Если Объект.ВопросыПроверочногоСписка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СтатистикаВопросыПроверочногоСписка.Вопрос,
	               |	ИА_ВопросыПроверочногоСписка.ВариантныйОтвет,
	               |	ИА_ВопросыПроверочногоСписка.ОтветВопроса
	               |ИЗ
	               |	Документ.ИА_Статистика.ВопросыПроверочногоСписка КАК ИА_СтатистикаВопросыПроверочногоСписка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_ВопросыПроверочногоСписка КАК ИА_ВопросыПроверочногоСписка
	               |		ПО ИА_СтатистикаВопросыПроверочногоСписка.Вопрос = ИА_ВопросыПроверочногоСписка.Ссылка
	               |ГДЕ
	               |	ИА_СтатистикаВопросыПроверочногоСписка.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Отбор = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Отбор.Вставить("Вопрос", Выборка.Вопрос);
		МассивСтрок = Объект.ВопросыПроверочногоСписка.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка, "ВариантныйОтвет, ОтветВопроса");
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаПриАктивизацииЯчейки(Элемент)
	эл = Элемент.ТекущийЭлемент;
	Если эл.Имя = "ВопросыПроверочногоСпискаОтвет" Тогда
		тд = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
		Если тд<>Неопределено Тогда
			Если тд.ВариантныйОтвет Тогда
				эл.ВыбиратьТип = истина;
			Иначе
				эл.ВыбиратьТип = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПроверочногоСпискаОтветПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ВопросыПроверочногоСписка.ТекущиеДанные;
	ПересчитатьБаллСтроки(ТекущаяСтрока);
КонецПроцедуры

//<- Григорьева
&НаКлиенте
Процедура Аналитика1ПриИзменении(Элемент)
	Элементы.Аналитика1.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Аналитика1);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика2ПриИзменении(Элемент)
	Элементы.Аналитика2.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Аналитика2);
КонецПроцедуры

&НаКлиенте
Процедура Аналитика3ПриИзменении(Элемент)
	Элементы.Аналитика3.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Аналитика3);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если БыстрыйРежим Тогда
		Элементы.Номер.Видимость = Ложь;
		Элементы.ДатаВвода.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		
		Элементы.ФормаКнопка1.Видимость = Ложь;
		Элементы.ФормаКнопка2.Видимость = Ложь;
		Элементы.ФормаКнопка3.Видимость = Ложь;
		Элементы.ФормаКнопка4.Видимость = Ложь;
	КонецЕсли;
	
	ОбновитьВидимостьПакетногоВвода();
	ВопросыПроверочногоСпискаУстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ВидСтатистикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоПакета()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Аналитика1 КАК Аналитика1,
	               |	ТЗ.Аналитика2 КАК Аналитика2,
	               |	ТЗ.Аналитика3 КАК Аналитика3,
	               |	ТЗ.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТЗ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_СтатистикаПакетСтатистик.Аналитика1 КАК Аналитика1,
	               |	ИА_СтатистикаПакетСтатистик.Аналитика2 КАК Аналитика2,
	               |	ИА_СтатистикаПакетСтатистик.Аналитика3 КАК Аналитика3,
	               |	ИА_СтатистикаПакетСтатистик.Количество КАК Количество
	               |ИЗ
	               |	ВТЗ КАК ИА_СтатистикаПакетСтатистик
	               |ИТОГИ
	               |	СУММА(Количество)
	               |ПО
	               |	Аналитика1,
	               |	Аналитика2,
	               |	Аналитика3";
	Запрос.УстановитьПараметр("ТЗ", Объект.ПакетСтатистик.Выгрузить());
	
	Дер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	
	РезДер = РеквизитФормыВЗначение("ПакетноеДерево");
	РезДер.Строки.Очистить();
	
	Для каждого стр1 из Дер.Строки Цикл
		Новстр1 = РезДер.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр1,стр1);
		Для каждого стр2 из стр1.Строки Цикл
			Если ЗначениеЗаполнено(стр2.Аналитика2) Тогда
				Новстр2 = Новстр1.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр2,стр2);
			Иначе
				Продолжить;
			КонецЕсли;
			
			Для каждого стр3 из стр2.Строки Цикл
				Если ЗначениеЗаполнено(стр3.Аналитика3) Тогда
					Новстр3 = Новстр2.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(Новстр3,стр3);
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//
	ЗначениеВРеквизитФормы(РезДер, "ПакетноеДерево");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиДерева()
	Для каждого стр1 из ПакетноеДерево.ПолучитьЭлементы() Цикл
		Если стр1.ПолучитьЭлементы().Количество()>0 Тогда
			Итог1 = 0;
			Для каждого стр2 из стр1.ПолучитьЭлементы() Цикл
				Если стр2.ПолучитьЭлементы().Количество()>0 Тогда
					Итог2 = 0;
					Для каждого стр3 из стр2.ПолучитьЭлементы() Цикл
						Итог2 = Итог2 + стр3.Количество;
					КонецЦикла;
					стр2.Количество = Итог2;
				КонецЕсли;
				Итог1 = Итог1 + стр2.Количество;
			КонецЦикла;
			стр1.Количество = Итог1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоКоличествоПриИзменении(Элемент)
	Модифицированность = истина;
	
	ПересчитатьИтогиДерева();
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоПослеУдаления(Элемент)
	Модифицированность = истина;
	ПересчитатьИтогиДерева();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПервойСтроке()
	для каждого стр1 из ПакетноеДерево.ПолучитьЭлементы() Цикл
		Если КоличествоАналитик = 1 Тогда
			ЗаполнитьЗначенияСвойств(Объект, стр1);
			Возврат;
		КонецЕсли;
		для каждого стр2 из стр1.ПолучитьЭлементы() Цикл
			Если КоличествоАналитик = 2 Тогда
				ЗаполнитьЗначенияСвойств(Объект, стр2);
				Возврат;
			КонецЕсли;
			для каждого стр3 из стр2.ПолучитьЭлементы() Цикл
				Если КоличествоАналитик = 3 Тогда
					ЗаполнитьЗначенияСвойств(Объект, стр3);
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВводНесколькихЗначенийПриИзменении(Элемент)
	Если не Объект.ВводНесколькихЗначений Тогда
		Если ПакетноеДерево.ПолучитьЭлементы().Количество()>0 тогда
			Если Вопрос("Список введенных значений будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
				ЗаполнитьПоПервойСтроке();
				ПакетноеДерево.ПолучитьЭлементы().Очистить();
			Иначе
				Объект.ВводНесколькихЗначений = истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВидимостьПакетногоВвода();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначение(Команда)
	Модифицированность = истина;
	
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	Если тд <> Неопределено Тогда
		ТекРод = тд.ПолучитьРодителя();
		Если ТекРод = Неопределено Тогда
			ТекРод = ПакетноеДерево;
		КонецЕсли;
	иначе
		ТекРод = ПакетноеДерево;
	КонецЕсли;	
				
	Новстр = ТекРод.ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(Новстр, ТекРод);
	
	СтрАн = ДобавитьСтрокиАналитик(ТекРод, Новстр);
	Элементы.ПакетноеДерево.ТекущаяСтрока = СтрАн;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьУровеньСтроки(СтрокаДерева)
	ТекУровень = 1;
	ТекСтр = СтрокаДерева;
	Пока ТекСтр.ПолучитьРодителя() <> Неопределено цикл
		ТекУровень = ТекУровень + 1;
		ТекСтр = ТекСтр.ПолучитьРодителя()
	КонецЦикла;
	
	Возврат ТекУровень;
КонецФункции

&НаКлиенте
Функция ДобавитьСтрокиАналитик(КоллСтрок, ДобавленнаяСтрока)
	Рез = ДобавленнаяСтрока.ПолучитьИдентификатор();
	
	ТекУровень = ПолучитьУровеньСтроки(ДобавленнаяСтрока);
	
	ПредСтр = ДобавленнаяСтрока;
	Пока ТекУровень < КоличествоАналитик Цикл
		Новстр = ПредСтр.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, ПредСтр);
		
		рез = Новстр.ПолучитьИдентификатор();
		ТекУровень = ТекУровень + 1;	
		ПредСтр = Новстр;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

&НаСервере
Процедура УстановитьКоличествоАналитик()
	КоличествоАналитик = 0;
	КоличествоАналитик =  ?(ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика1),1,0) + ?(ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика2),1,0) + ?(ЗначениеЗаполнено(Объект.ВидСтатистики.Аналитика3),1,0);
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоПриАктивизацииСтроки(Элемент)
	Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика1.ТолькоПросмотр = истина;
	Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика2.ТолькоПросмотр = истина;
	Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика3.ТолькоПросмотр = истина;
	Элемент.ПодчиненныеЭлементы.ПакетноеДеревоКоличество.ТолькоПросмотр = истина;
	
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		ТекУровень = ПолучитьУровеньСтроки(тд);
		Элемент.ПодчиненныеЭлементы["ПакетноеДеревоАналитика"+ ТекУровень].ТолькоПросмотр = ложь;
		Если ТекУровень = КоличествоАналитик Тогда
			Элемент.ПодчиненныеЭлементы.ПакетноеДеревоКоличество.ТолькоПросмотр = ложь;
		КонецЕсли;
		
		
		//
		Если ТекУровень = 1 и не ЗначениеЗаполнено(тд.Аналитика1) Тогда
			УстановитьТипНаКлиенте(ПолучитьПолныйТипАналитики(Объект.ВидСтатистики,1) ,Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика1, тд.Аналитика1);
			Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика1.ВыбиратьТип = Ложь;
		КонецЕсли;
		Если ТекУровень = 2 и не ЗначениеЗаполнено(тд.Аналитика2) Тогда
			УстановитьТипНаКлиенте(ПолучитьПолныйТипАналитики(Объект.ВидСтатистики,2) ,Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика2, тд.Аналитика2);
			Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика2.ВыбиратьТип = Ложь;
		КонецЕсли;
		Если ТекУровень = 3 и не ЗначениеЗаполнено(тд.Аналитика3) Тогда
			УстановитьТипНаКлиенте(ПолучитьПолныйТипАналитики(Объект.ВидСтатистики,3) ,Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика3, тд.Аналитика3);
			Элемент.ПодчиненныеЭлементы.ПакетноеДеревоАналитика3.ВыбиратьТип = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипНаКлиенте(ЗначТип,ЭлФормы,Рекв)
	Если ЗначТип = "" Тогда
		Возврат
	КонецЕсли;

    Массив = Новый Массив;
	Массив.Добавить(Тип(ЗначТип));       
	Стр = Новый ОписаниеТипов(Массив);
	ЭлФормы.ОграничениеТипа = Стр;                 
	ЭлФормы.ОграничениеТипа.ПривестиЗначение();
	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочники");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документы");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисления");
	Если ЗначТип1 = "" Тогда 		
		Рекв = ПредопределенноеЗначение("Справочник.ИА_ЗначениеАналитики.ПустаяСсылка");
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		Рекв = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		Рекв = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		Рекв = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		Рекв = Дата("01010001");
	Иначе
		Рекв = ПолучитьСсылкуПоТипу(ЗначТип1);
	КонецЕсли;
	
	ЭлФормы.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоТипу(пТип)
	Возврат Вычислить(пТип+".ПустаяСсылка()");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПолныйТипАналитики(ВидСт, НомерАн)
	Возврат ВидСт["Аналитика"+НомерАн].ТипАналитикиПолный;
КонецФункции

&НаКлиенте 
Процедура УстановитьАналитикуВСтрокиДерева(Колл, НомерАн)
	Для каждого стр из Колл.ПолучитьЭлементы() Цикл
		стр["Аналитика"+НомерАн] = Колл["Аналитика"+НомерАн];
		Для каждого стр2 из стр.ПолучитьЭлементы() Цикл
			стр2["Аналитика"+НомерАн] = Колл["Аналитика"+НомерАн];
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоАналитика1ПриИзменении(Элемент)
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	УстановитьАналитикуВСтрокиДерева(тд, 1);	
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоАналитика2ПриИзменении(Элемент)
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	УстановитьАналитикуВСтрокиДерева(тд, 2);	
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоАналитика3ПриИзменении(Элемент)
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	УстановитьАналитикуВСтрокиДерева(тд, 3);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ПакетСтатистик.Очистить();
	Если Объект.ВводНесколькихЗначений Тогда
		Для каждого стр1 из ПакетноеДерево.ПолучитьЭлементы() Цикл
			Если КоличествоАналитик = 1 Тогда
				Новстр = Объект.ПакетСтатистик.Добавить();
				ЗаполнитьЗначенияСвойств(Новстр, стр1);
				Продолжить;
			КонецЕсли;
			
			Для каждого стр2 из стр1.ПолучитьЭлементы() Цикл
				Если КоличествоАналитик = 2 Тогда
					Новстр = Объект.ПакетСтатистик.Добавить();
					ЗаполнитьЗначенияСвойств(Новстр, стр2);
					Продолжить;
				КонецЕсли;
				Для каждого стр3 из стр2.ПолучитьЭлементы() Цикл
					Новстр = Объект.ПакетСтатистик.Добавить();
					ЗаполнитьЗначенияСвойств(Новстр, стр3);
				КонецЦикла;	
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоАналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	НачалоВыбораАналитики(1, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоАналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	НачалоВыбораАналитики(2, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеДеревоАналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.ПакетноеДерево.ТекущиеДанные;
	НачалоВыбораАналитики(3, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры
